app/controllers/movies_controller.rb

  def index
    # Retrieve ratings from movies table
    @all_ratings = Movie.ratings

    # COLUMN SORTING LOGIC
    if params[:sort]!=nil
      # Use user-specificd sort filter
      @sort= params[:sort].to_s
      # Update session state
      session[:sort]= @sort
    elsif session[:sort]!=nil
      # Restore session state
      @sort= session[:sort]
    else
      @sort= nil
    end

    # RATING FILTER LOGIC
    if params[:ratings]!=nil
      # Use user-specified rating filters
      @ratings = params[:ratings]
      # Update state
      session[:ratings] = @ratings
    elsif session[:ratings]!=nil
      # Restore rating filters from if there exists a previous session
      @ratings = session[:ratings]
    else # First Load of page... show all ratings
      # Create a hash to simulate ratings[] value retrieved from checkboxes
      ratings_hash = {}
      @all_ratings.each {|rating| ratings_hash[rating]="1"}
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date